app/views/clients/index.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."client_id" = ? LIMIT ?  [["client_id", 1], ["LIMIT", 1]]
---
              <td><%= link(client) %></p></td>
              <% if client.orders? %>