app/views/clients/index.html.erb

          <div class="column is-3">
            <% client.cars.each do |car| %>
---
SELECT "cars"."id" FROM "cars" WHERE "cars"."client_id" = ?  [["client_id", 1]]