app/views/orders/edit.html.erb

SELECT "clients".* FROM "clients"
---
    <%= order_form.label :Клиент  %>
      <%= order_form.collection_select(:client_id,
                                 Client.all,
                                 :id,
                                 :licence, { prompt: 'Select', selected: @client },
                                 { data: { source: 'clients' }}) %>