app/views/orders/new.html.erb

    <%= order_form.label :Клиент  %>
      <%= order_form.collection_select(:client_id,
                                 Client.all,
                                 :id,
                                 :licence, { prompt: 'Select', selected: @client },
                                 { data: { source: 'clients' }}) %>
---
SELECT "clients".* FROM "clients"