app/views/orders/new.html.erb

  <h1>Добавить ордер</h1>
  <%= render "form", order: @order, client: Client.find(params[:client_id])  %>
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]