app/views/orders/show.html.erb

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
          </p>
        <% elsif @order.client.cars&.first.present? %>