app/controllers/admin_controller.rb

  def index
   @total_cars = Car.count
   @total_clients = Client.count
---
SELECT COUNT(*) FROM "cars"
SELECT COUNT(*) FROM "clients"