app/controllers/cars_controller.rb

  def create
    @car = Car.new(car_params)
    respond_to do |format|
      if @car.save

<<<<<<< HEAD
        # если мы выбрали ecm, тогда метод будет вызываться #
         folder_create unless @car.ecm_id.blank?
---
SELECT "ecms".* FROM "ecms"