app/controllers/cars_controller.rb

INSERT INTO "cars" ("licence", "vin", "mileage", "ecm_id", "sum", "model_id", "make_id", "client_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @car = Car.new(car_params)
    respond_to do |format|
      if @car.save

UPDATE "cars" SET "ecm_id" = ?, "model_id" = ?, "make_id" = ?, "client_id" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["ecm_id", 3], ["model_id", 100], ["make_id", 7], ["client_id", 2], ["updated_at", "2022-09-19 12:56:48.256074"], ["id", 2]]
---
    def update
      respond_to do |format|
        if @car.update(car_params)

DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 1]]
---
    def destroy
      @car.destroy

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "makes".* FROM "makes" WHERE "makes"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT "models".* FROM "models" WHERE "models"."id" = ? LIMIT ?  [["id", 143], ["LIMIT", 1]]
---
    def mileage_create
      @licence = Client.find_by_id(car_params[:client_id]).licence
      @make = Make.find_by_id(car_params[:make_id]).name
      @model = Model.find_by_id(car_params[:model_id]).name

SELECT "ecms".* FROM "ecms" WHERE "ecms"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
    def folder_create
      @datetime = Time.new
      @licence = Client.find_by_id(car_params[:client_id]).licence
      @mileage = car_params[:mileage]
      @phone = car_params[:phone]
      @make = Make.find_by_id(car_params[:make_id]).name
      @model = Model.find_by_id(car_params[:model_id]).name
      @ecm = Ecm.find_by_id(car_params[:ecm_id]).name