app/controllers/clients_controller.rb

    def index
      @clients = Client.all
---
SELECT "clients".* FROM "clients" WHERE (phone LIKE '%%')

    def show
      @client = Client.find(params[:id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
       @client = Client.new(client_params)
       @client.licence = params[:client][:licence]
       @client.name = params[:client][:name].capitalize
       @client.phone = params[:client][:phone]
       @client.data = params[:client][:data]
       @client.save
---
INSERT INTO "clients" ("licence", "name", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["licence", "1"], ["name", "1"], ["phone", "1"], ["created_at", "2022-09-16 16:31:34.540870"], ["updated_at", "2022-09-16 16:31:34.540870"]]

    def edit
      @client = Client.find(params[:id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]