app/controllers/orders_controller.rb

  def update
    # Получаем список ранее прикрепленных файлов и изображений
    existing_files = @order.files_attachments.map(&:blob)
    existing_images = @order.images_attachments.map(&:blob)

    # Обновляем заказ с новыми параметрами
    if @order.update(order_params.reject { |key| key['files'] || key['images'] })
      # Если были загружены новые файлы или изображения, то добавляем их к списку ранее прикрепленных
      @order.files.attach(params[:order][:files]) if params[:order][:files]
---
INSERT INTO "orders" ("problem", "work_description", "price", "created_at", "updated_at", "client_id", "status") VALUES (?, ?, ?, ?, ?, ?, ?)  [["problem", "123777"], ["work_description", "123"], ["price", 123], ["created_at", "2022-09-18 09:11:24.776319"], ["updated_at", "2022-09-18 09:11:24.776319"], ["client_id", 1], ["status", 0]]

  def set_client
    @client = Client.find(params[:client_id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]