app/controllers/orders_controller.rb

  def index
    @client = Client.find params[:client_id]
    @orders = Order.all.where("client_id == #{params[:client_id]}")
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @client = Client.find_by(id: order_params[:client_id])
    @order = Order.new order_params
    @order.client = @client

    if @order.save
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("problem", "work_description", "price", "created_at", "updated_at", "client_id", "status") VALUES (?, ?, ?, ?, ?, ?, ?)  [["problem", "test"], ["work_description", "test"], ["price", 23], ["created_at", "2022-09-19 12:23:08.642348"], ["updated_at", "2022-09-19 12:23:08.642348"], ["client_id", 1], ["status", 0]]

  def edit
    @client = Client.find params[:client_id]
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    if @order.update(order_params)
---
UPDATE "orders" SET "problem" = ?, "work_description" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["problem", "Проблема пети 123777"], ["work_description", "Ремонт сделали7777"], ["updated_at", "2022-09-18 09:13:50.463086"], ["id", 5]]

  def destroy
    @order.destroy
---
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 4]]