app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "1"], ["password_digest", "[FILTERED]"], ["created_at", "2022-09-16 16:31:22.172597"], ["updated_at", "2022-09-16 16:31:22.172597"]]
---
  def create
    @user = User.new(user_params)
    @user.admin = true if User.all.empty?

    if @user.save