app/models/client.rb

SELECT "orders".* FROM "orders" WHERE "orders"."client_id" = ? LIMIT ?  [["client_id", 1], ["LIMIT", 1]]
---
  def orders?
    true if self.orders.present?