app/views/cars/_car.html.erb

SELECT "ecms".* FROM "ecms" WHERE "ecms"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
---
      <td><%= car.vin %> </td>
      <td> <%= sanitize(car.ecm.name) if car.ecm.present? %></td>

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <td> <%= sanitize(car.model_ecu.name) if car.model_ecu.present? %></td>
      <td> <%= car.client.id if car.client.present?   %> </td>