app/views/cars/_form.html.erb

        <div class="control">
          <%= form.collection_select(:make_id,
                                     Make.all,
                                     :id,
                                     :name, { prompt: 'Select', selected: @car.make_id },
                                     { data: { source: 'makes' },
                                       onchange: 'document.getElementById("car_soft_ecu_id").selectedIndex = 0;
                                       $(\'[data-parent-id="car_soft_ecu_id"]\').empty();
                                       $.ajax({url: "/soft_ecus?model_ecu_id=" + document.getElementById("car_model_ecu_id").value,
                                       success: function(data) {$(\'[data-parent-id="car_soft_ecu_id"]\').html(data);}});' }
                                    ) %>
        </div>
      </div>
    </div>

    <div class="column is-one-two">
      <div class="field">
        <%= form.label :model_id, style: "color: blue" %>
        <div class="control">
          <%= form.collection_select(:model_id,
                                     @car.make&.models || [],
                                     :id,
                                     :name, { prompt: 'Select', selected: @car.model_id },
                                     { data: { parent_id: 'car_make_id', source: 'models'},
                                       onchange: 'document.getElementById("car_soft_ecu_id").selectedIndex = 0;
                                       $(\'[data-parent-id="car_soft_ecu_id"]\').empty();' }) %>
        </div>
      </div>
    </div>

    <div class="column">
      <div class="field">
        <%= form.label :works, 'Вид работ', style: "color: blue" %>
        <div class="control">
          <% if @model.present? %>
            <%= form.select :works, ["Diagnose", "Programm", "Mileage_km", "Airbag"], selected: @model.works %>
          <% else %>
            <%= form.select :works, ["Diagnose", "Programm", "Mileage_km", "Airbag"] %>
          <% end %>
        </div>
      </div>
---
SELECT "makes".* FROM "makes" WHERE "makes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "models".* FROM "models" WHERE "models"."make_id" = ?  [["make_id", 2]]
SELECT "makes".* FROM "makes" WHERE "makes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]