app/views/cars/_form.html.erb

SELECT "makes".* FROM "makes"
---
        <div class="control">
          <%= form.collection_select(:make_id,
                                     Make.all,
                                     :id,
                                     :name, { prompt: 'Select', selected: @car.make_id },
                                     { data: { source: 'makes' }}) %>

SELECT "ecms".* FROM "ecms" ORDER BY "ecms"."name" ASC
---
        <div class="control">
          <%= form.collection_select(:ecm_id,
                                     Ecm.all,
                                     :id,
                                     :name, { prompt: 'Select', selected: @name },
                                     { data: { source: 'ecm' }}) %>